Applying log sink on prod project to start - with a target of existing bucket - will switch to pubsub
<img width="1794" alt="Screenshot 2023-10-15 at 21 52 02" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/0237d340-2ef3-4fff-a4e0-12c015cd4451">
<img width="1316" alt="Screenshot 2023-10-15 at 21 52 34" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/d39b538a-427b-47c1-80d6-7ea9bb9730a7">
preview logs from the router pane

<img width="1792" alt="Screenshot 2023-10-15 at 21 57 50" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/9cc224b5-032c-4c5c-8073-ef2ce7c1fec8">


```

Step #3 - "tf plan": Terraform will perform the following actions:
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.project-level-log-sink.google_logging_project_sink.my-sink will be created
Step #3 - "tf plan":   + resource "google_logging_project_sink" "my-sink" {
Step #3 - "tf plan":       + destination            = "logging.googleapis.com/projects/tzpe-tlz-audittlz-tlz/locations/northamerica-northeast1/buckets/20231015tlz"
Step #3 - "tf plan":       + filter                 = "resource.type = gce_instance AND severity >= INFO"
Step #3 - "tf plan":       + id                     = (known after apply)
Step #3 - "tf plan":       + name                   = "20231015-sink"
Step #3 - "tf plan":       + project                = "tzpe-tlz-tlzprod-host4"
Step #3 - "tf plan":       + unique_writer_identity = true
Step #3 - "tf plan":       + writer_identity        = (known after apply)
Step #3 - "tf plan": 
Step #3 - "tf plan":       + bigquery_options {
Step #3 - "tf plan":           + use_partitioned_tables = (known after apply)
Step #3 - "tf plan":         }
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.service_accounts.data.template_file.keys["sa"] will be read during apply
Step #3 - "tf plan":   # (config refers to values not yet known)
Step #3 - "tf plan":  <= data "template_file" "keys"  {
Step #3 - "tf plan":       ~ id       = "e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855" -> (known after apply)
Step #3 - "tf plan":       + rendered = (known after apply)
Step #3 - "tf plan":         # (2 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.net-host-prj.module.project.google_project.project will be updated in-place
Step #3 - "tf plan":   ~ resource "google_project" "project" {
Step #3 - "tf plan":         id                  = "projects/tzpe-tlz-tlzprod-host4"
Step #3 - "tf plan":       ~ labels              = {
Step #3 - "tf plan":           - "date_modified" = "2023-10-16"
Step #3 - "tf plan":         } -> (known after apply)
Step #3 - "tf plan":         name                = "TzPe-tlz-tlzprod-host4"
Step #3 - "tf plan":         # (5 unchanged attributes hidden)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.net-host-prj.module.network["tlzprod-svpc"].module.subnets["prsubnet02"].google_compute_subnetwork.subnetwork will be updated in-place
Step #3 - "tf plan":   ~ resource "google_compute_subnetwork" "subnetwork" {
Step #3 - "tf plan":         id                         = "projects/tzpe-tlz-tlzprod-host4/regions/northamerica-northeast1/subnetworks/tzpecnr-prsubnet02-host4-snet"
Step #3 - "tf plan":         name                       = "tzpecnr-prsubnet02-host4-snet"
Step #3 - "tf plan":         # (13 unchanged attributes hidden)
Step #3 - "tf plan": 
Step #3 - "tf plan":       ~ log_config {
Step #3 - "tf plan":           - metadata             = "EXCLUDE_ALL_METADATA" -> null
Step #3 - "tf plan":             # (4 unchanged attributes hidden)
Step #3 - "tf plan":         }
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan": Plan: 1 to add, 2 to change, 0 to destroy.


module.service_accounts.data.template_file.keys["sa"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.net-host-prj.module.network["tlzprod-svpc"].module.subnets["prsubnet02"].google_compute_subnetwork.subnetwork: Modifying... [id=projects/tzpe-tlz-tlzprod-host4/regions/northamerica-northeast1/subnetworks/tzpecnr-prsubnet02-host4-snet]
module.net-host-prj.module.network["tlzprod-svpc"].module.subnets["prsubnet02"].google_compute_subnetwork.subnetwork: Modifications complete after 1s [id=projects/tzpe-tlz-tlzprod-host4/regions/northamerica-northeast1/subnetworks/tzpecnr-prsubnet02-host4-snet]
module.project-level-log-sink.google_logging_project_sink.my-sink: Creating...
module.project-level-log-sink.google_logging_project_sink.my-sink: Creation complete after 2s [id=projects/tzpe-tlz-tlzprod-host4/sinks/20231015-sink]
```

fixed hardcoded audit project - to pick up prod shared VPC project, removed gce specific log filter, moved bucket to prod from audit. Pending is code to create the bucket

https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/storage_bucket

<img width="1036" alt="Screenshot 2023-10-15 at 22 20 43" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/e113cd29-045f-4e6a-84e1-23eba5002c38">



we can target splunk
<img width="576" alt="Screenshot 2023-10-15 at 21 58 58" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/48ac3876-ab36-4fdf-b006-63f1597ce632">
